dominiczy/satelliteplatform/processors/msp430at/msp430_pipe_EX.cpp
/******************************************************
 * Stage module implementation file.                  *
 * This file is automatically generated by ArchC      *
 * WITHOUT WARRANTY OF ANY KIND, either express       *
 * or implied.                                        *
 * For more information on ArchC, please visit:       *
 * http://www.archc.org                               *
 *                                                    *
 * The ArchC Team                                     *
 * Computer Systems Laboratory (LSC)                  *
 * IC-UNICAMP                                         *
 * http://www.lsc.ic.unicamp.br                       *
 ******************************************************/

#include "msp430_pipe_EX.H"

inline void msp430_pipe_EX::msp430_pipe_EX::behavior()
{
 unsigned ins_id;
 ac_instr_t* instr_vec;

 if (ac_stop_flag)
  return;
 if (is_stalled())
  ctrl.request_update();
 instr_vec = new ac_instr_t(regin->read());
 ins_id = instr_vec->get(IDENT);
 if (ins_id != 0)
 {
  isa.current_instruction_id = ins_id;
  isa._behavior_instruction(static_cast<msp430_parms::ac_stage_list>(id), 0);
  switch (ins_id)
  {
   case 1: // mov_48imm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_mov_48imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 2: // mov_48idm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_mov_48idm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 3: // add_48idm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_add_48idm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 4: // add_48imm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_add_48imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 5: // addc_48idm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_addc_48idm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 6: // addc_48imm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_addc_48imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 7: // and_48idm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_and_48idm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 8: // and_48imm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_and_48imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 9: // bic_48idm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_bic_48idm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 10: // bic_48imm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_bic_48imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 11: // bis_48idm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_bis_48idm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 12: // bis_48imm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_bis_48imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 13: // bit_48idm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_bit_48idm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 14: // bit_48imm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_bit_48imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 15: // cmp_48idm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_cmp_48idm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 16: // cmp_48imm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_cmp_48imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 17: // dadd_48idm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_dadd_48idm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 18: // dadd_48imm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_dadd_48imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 19: // sub_48idm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_sub_48idm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 20: // sub_48imm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_sub_48imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 21: // subc_48idm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_subc_48idm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 22: // subc_48imm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_subc_48imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 23: // xor_48idm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_xor_48idm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 24: // xor_48imm
    isa._behavior_msp430_Double_48(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    isa.behavior_xor_48imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(2), instr_vec->get(3), instr_vec->get(4), instr_vec->get(5), instr_vec->get(6), instr_vec->get(7), instr_vec->get(8));
    break;
   case 25: // mov_32idst
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_mov_32idst(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 26: // mov_32isrc
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_mov_32isrc(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 27: // mov_32imm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_mov_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 28: // mov_32iaim
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_mov_32iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 29: // mov_32irm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_mov_32irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 30: // add_32idst
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_add_32idst(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 31: // add_32isrc
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_add_32isrc(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 32: // add_32imm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_add_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 33: // add_32iaim
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_add_32iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 34: // add_32irm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_add_32irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 35: // addc_32idst
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_addc_32idst(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 36: // addc_32isrc
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_addc_32isrc(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 37: // addc_32imm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_addc_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 38: // addc_32iaim
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_addc_32iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 39: // addc_32irm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_addc_32irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 40: // and_32idst
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_and_32idst(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 41: // and_32isrc
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_and_32isrc(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 42: // and_32imm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_and_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 43: // and_32iaim
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_and_32iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 44: // and_32irm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_and_32irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 45: // bic_32idst
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_bic_32idst(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 46: // bic_32isrc
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_bic_32isrc(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 47: // bic_32imm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
