dominiczy/satelliteplatform/processors/msp430at/msp430_pipe_EX.cpp
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_bic_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 100: // bis_16rm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_bis_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 101: // bis_16irm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_bis_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 102: // bis_16iaim
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_bis_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 103: // bit_16rm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_bit_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 104: // bit_16irm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_bit_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 105: // bit_16iaim
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_bit_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 106: // cmp_16rm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_cmp_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 107: // cmp_16irm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_cmp_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 108: // cmp_16iaim
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_cmp_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 109: // dadd_16rm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_dadd_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 110: // dadd_16irm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_dadd_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 111: // dadd_16iaim
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_dadd_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 112: // sub_16rm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_sub_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 113: // sub_16irm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_sub_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 114: // sub_16iaim
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_sub_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 115: // subc_16rm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_subc_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 116: // subc_16irm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_subc_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 117: // subc_16iaim
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_subc_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 118: // xor_16rm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_xor_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 119: // xor_16irm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_xor_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 120: // xor_16iaim
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_xor_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 121: // rrc_32sm
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_rrc_32sm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 122: // rrc_32am
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_rrc_32am(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 123: // rrc_32imm
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_rrc_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 124: // rrc_32im
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_rrc_32im(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 125: // rra_32sm
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_rra_32sm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 126: // rra_32am
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_rra_32am(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 127: // rra_32imm
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_rra_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 128: // rra_32im
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_rra_32im(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 129: // swpb_32sm
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_swpb_32sm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 130: // swpb_32am
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_swpb_32am(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 131: // swpb_32imm
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_swpb_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 132: // swpb_32im
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_swpb_32im(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 133: // sxt_32sm
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_sxt_32sm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 134: // sxt_32am
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_sxt_32am(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 135: // sxt_32imm
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_sxt_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 136: // sxt_32im
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_sxt_32im(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 137: // push_32sm
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_push_32sm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 138: // push_32am
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_push_32am(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 139: // push_32imm
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_push_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 140: // push_32im
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_push_32im(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 141: // call_32sm
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_call_32sm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 142: // call_32am
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_call_32am(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 143: // call_32imm
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_call_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 144: // call_32im
    isa._behavior_msp430_Single_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_call_32im(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(21), instr_vec->get(22), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 145: // rrc_16rm
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_rrc_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 146: // rrc_16irm
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_rrc_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 147: // rrc_16iaim
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_rrc_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 148: // rra_16rm
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_rra_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 149: // rra_16irm
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_rra_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 150: // rra_16iaim
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_rra_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 151: // swpb_16rm
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_swpb_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 152: // swpb_16irm
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_swpb_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 153: // swpb_16iaim
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_swpb_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 154: // sxt_16rm
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
